Revit 2024 API
CableTraySizes Class
 Cable tray sizes.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class CableTraySizes : Element,
	IEnumerable<MEPSize>
Visual Basic
Public Class CableTraySizes _
	Inherits Element _
	Implements IEnumerable(Of MEPSize)
Visual C++
public ref class CableTraySizes : public Element,
	IEnumerable<MEPSize^>
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.CableTraySizes
See Also
CableTraySizes Members
Autodesk.Revit.DB.Electrical Namespace